#### ThermalMaterialType Enumeration

---

|  |
| --- |
| See Also |

Represents the thermal material type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ThermalMaterialType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ThermalMaterialType ``` |

| Visual C++ |
| --- |
| ``` public enum class ThermalMaterialType ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined | Thermal material type is undefined. |
| Gas | Thermal material type is gas. |
| Liquid | Thermal material type is liquid. |
| Solid | Thermal material type is solid. |

# See Also

Autodesk.Revit.DB Namespace